#pragma once

//============================================================================ =
//@    2つの整数を一つの構造体で扱うため
//@brief        :    構造体定義
//==============================================================================/
typedef struct
{
    union
    {
        int i[2];
        struct
        {
            int x, y;
        };
    };
}Int2;


//============================================================================ =
//@    2つの少数を一つの構造体で扱うため
//@brief        :    構造体定義
//==============================================================================/
typedef struct
{
    union
    {
        float f[2];
        struct
        {
            float x, y;
        };
    };
}Float2;

Int2 MakeInt2(int _x, int _y);
Float2 MakeFloat2(float _x, float _y);